Конфигурация/Catalogs/ДенежныеПотокиПоОблигациям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ДенежныеПотокиПоОблигациям</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Облигации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРасчетаПотока</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поток</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Купон</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Catalogs/ДенежныеПотокиПоОблигациям/Ext/ManagerModule.bsl
Функция ПолучитьХэш(ОбъектСправочникаПотоков) Экспорт
	
	СтрокаДляХэша = Формат(ОбъектСправочникаПотоков.ДатаРасчетаПотока, "ДФ=dd.MM.yyyy");
	Для каждого СтрокаПотоков Из ОбъектСправочникаПотоков.Поток Цикл
		СтрокаДляХэша = СтрокаДляХэша + РаботаСоСтрокамиКлиентСервер.ПодставитьПараметрыВСтроку("%1 %2 %3, ", СтрокаПотоков.Дата, СтрокаПотоков.Сумма, СтрокаПотоков.Купон);
	КонецЦикла;
	
	Хеширование = Новый ХешированиеДанных(ХешФункция.MD5);
	Хеширование.Добавить(СтрокаДляХэша);
	
	Возврат СокрЛП(СтрЗаменить(Хеширование.ХешСумма, " ", ""));

КонецФункции
